import sys
input = sys.stdin.readline
'''
    j = 1 ~ 10	<--- 1
        1, 3 ,5, 7 ,9     <--- 2
        1, 4. 7, 10       <--- 3
        1, 5, 9            <--- 4
        1, 6               <--- 5
        1, 7               <--- 6
        1, 8               <--- 7
        1, 9               <--- 8
        1, 10              <--- 9
        1                   <---10


    10^9 = 10 초 

    log(n)
    n = 10
    i = 배수
    j = 서로 떨어진 간격
    num = 
    ans = 반복 횟수 

    n = 10
        2 2 5 15
        3 3 4 19
        4 4 3 22    
        5 9 2 32       // 이걸 보면 i = 현재 시작 배수, j = 끝 배수, num = 1 ~ (n-1) 까지의 등장 횟수
        33

        

    9 // (9 // 5) => 9 // 1 => 9

    
'''

n = int(input())
ans = n

# zeroDivided 오류 때문에 1이 아니라면 1을 더해준다.
if n > 1:
    ans += 1

i = 2
while n > i:
    j = (n - 1) // (( n - 1) // i)
    num = 1 + ((n - 1) // i)
    ans += (1 + j - i) * num
    
    i = j + 1


print(ans)